/* -------------------------------------------------------------------------- */
/* code structure                                                             */
/*--------------------------------------------------------------------------- */


// 한 줄 주석
console.log('ECMAScript의 문은 어떠한 작업을 수행하는 문법 구조 및 명령을 의미합니다');

// 세미콜론(semicolons) 
console.log('다음 줄에서 코드를 작성할 경우 세미콜론을 붙인 것과 동일합니다.')
console.log('하지만 세미콜론을 명시적으로 추가할 것을 권항합니다.')

/* 
  여러 줄 (multi aines)
  주석 (comment)
  단축키 alt + shift + a
*/